# Mod14 Handling Duplicated Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.19.2'

In [3]:
pd.__version__

'1.1.2'

### Operating on Duplicated data

In [7]:
students = [('Jack', 34, 'Sydeny'),
            ('Riti', 30, 'Delhi'),
            ('Aadi', 16, 'New York'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Mumbai'),
            ('Aadi', 40, 'London'),
            ('Sachin', 30, 'Delhi')]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])

In [8]:
df

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30     Delhi
4    Riti   30     Delhi
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [10]:
# check if any records are duplicates
df.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [7]:
df.duplicated().any()

True

In [8]:
df.duplicated().values.any()

True

In [9]:
# count how many duplicates
df.duplicated().sum()

2

In [10]:
# list duplicated records
df[df.duplicated()]

   Name  Age   City
3  Riti   30  Delhi
4  Riti   30  Delhi

Alternatively, you can add ‘keep’ and indicate
whether you’d like to keep:
* keep='first', keep the first argumen(default)
* keep='last', keep the last argument
* keep=False, drop all the duplicates

In [13]:
df.duplicated(keep='first')

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [14]:
df.duplicated(keep='last')

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

In [15]:
df.duplicated(keep=False)

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

Passing columns name to  `subset`

In [11]:
# check duplicates in a particular column
df.duplicated(subset='City')

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7     True
dtype: bool

In [4]:
# check duplicates in some columns
df.duplicated(subset=['Name','City'])

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

Setting `subset` and `keep` simultaneously

In [12]:
df.duplicated(subset=('Name','Age'),keep='last')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [13]:
# show duplicated data, reserve last duplicated record
df[df.duplicated(subset=('Name','Age'),keep='last')]

   Name  Age   City
1  Riti   30  Delhi
3  Riti   30  Delhi
4  Riti   30  Delhi

In [14]:
# show duplicated data, reserve first duplicated record
df[df.duplicated(subset=('Name','Age'),keep='first')]

   Name  Age    City
3  Riti   30   Delhi
4  Riti   30   Delhi
5  Riti   30  Mumbai

In [15]:
# remove duplicated rows
df.drop_duplicates()

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [16]:
# drop duplicates from column
df.drop_duplicates(subset=['Age','City'])

   Name  Age      City
0  Jack   34    Sydeny
1  Riti   30     Delhi
2  Aadi   16  New York
5  Riti   30    Mumbai
6  Aadi   40    London

In [17]:
df.drop_duplicates(subset=('Name','Age'),keep=False)

     Name  Age      City
0    Jack   34    Sydeny
2    Aadi   16  New York
6    Aadi   40    London
7  Sachin   30     Delhi

## Lab

<b>有一個 DataFrame df，試著計算整列重複的資料有幾個?</b>

In [ ]:
df = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
df

<b>計算 'k1' 欄有幾個重複的資料</b>

<b>試著將整列重複的拋棄，只留第一筆重複值</b>